In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
df = pd.read_csv('PandasExample.csv')

In [5]:
df

           Name  Age  Gender
0        Nithin   24    Male
1         Manoj   30    Male
2  Shivashankar   44    Male
3        Swathi   18  Female
4   Pareekshith   28    Male

In [13]:
# .head() will show fist 5 column from the data set
df.head()

           Name  Age  Gender
0        Nithin   24    Male
1         Manoj   30    Male
2  Shivashankar   44    Male
3        Swathi   18  Female
4   Pareekshith   28    Male

In [10]:
# .tail() will show last 5 column from the data set
df.tail()

           Name  Age  Gender
0        Nithin   24    Male
1         Manoj   30    Male
2  Shivashankar   44    Male
3        Swathi   18  Female
4   Pareekshith   28    Male

In [14]:
df.head(2)

     Name  Age Gender
0  Nithin   24   Male
1   Manoj   30   Male

In [15]:
df.tail(2)

          Name  Age  Gender
3       Swathi   18  Female
4  Pareekshith   28    Male

In [16]:
df.shape

(5, 3)

In [17]:
df.iloc[0]

Name      Nithin
Age           24
Gender      Male
Name: 0, dtype: object

In [18]:
df.iloc[3]

Name      Swathi
Age           18
Gender    Female
Name: 3, dtype: object

In [19]:
df.values

array([['Nithin', 24, 'Male'],
       ['Manoj', 30, 'Male'],
       ['Shivashankar', 44, 'Male'],
       ['Swathi', 18, 'Female'],
       ['Pareekshith', 28, 'Male']], dtype=object)

In [20]:
# if the data size is large then we can  use chunksize 
df = pd.read_csv('PandasExample.csv', chunksize=2)

In [21]:
for chunk in df:
    print(chunk)

     Name  Age Gender
0  Nithin   24   Male
1   Manoj   30   Male
           Name  Age  Gender
2  Shivashankar   44    Male
3        Swathi   18  Female
          Name  Age Gender
4  Pareekshith   28   Male

In [22]:
df = pd.read_csv('PandasExample.csv')

In [23]:
df = df[df['Age']>25]

In [24]:
df

           Name  Age Gender
1         Manoj   30   Male
2  Shivashankar   44   Male
4   Pareekshith   28   Male

In [32]:
df = pd.read_csv('PandasExample.csv')

In [33]:
df = df[df['Age']<25]

In [34]:
df

     Name  Age  Gender
0  Nithin   24    Male
3  Swathi   18  Female